**IP01- Password Spray Attacks**

**Description:**  Collecting IPs recognized and tagged by DefenderXDR as malicious and related to Password Spray Attacks.
```
{
 "Query": " let Malicious_IP_iOC = AlertEvidence | where Title has 'Malicious IP Address' | extend parsed = parse_json(AdditionalFields) | extend Address = tostring(parsed.Address), Type = tostring(parsed.Type), MergeByKey = tostring(parsed.MergeByKey), MergeByKeyHex= tostring(parsed.MergeByKeyHex), CountryCode = tostring(parsed.Location.CountryCode), State = tostring(parsed.Location.State), City = tostring(parsed.Location.City), ASN = tostring(parsed.Location.Asn) | extend Time_ = format_datetime( Timestamp, 'dd-MM-yyyy'); AlertEvidence | extend parsed = parse_json(AdditionalFields) | extend Address = tostring(parsed.Address), Type = tostring(parsed.Type), MergeByKey = tostring(parsed.MergeByKey), MergeByKeyHex= tostring(parsed.MergeByKeyHex), CountryCode = tostring(parsed.Location.CountryCode),State = tostring(parsed.Location.State), City = tostring(parsed.Location.City), ASN = tostring(parsed.Location.Asn) | extend Time_ = format_datetime( Timestamp, 'dd-MM-yyyy') | join kind=inner (Malicious_IP_iOC) on $left.MergeByKey == $right.MergeByKey | where isnotempty(Address1) and Title contains 'Password Spray' | distinct Time_,Title, Address1, CountryCode | extend rawHash = substring(tostring(hash_sha256(strcat(1, tostring(rand())))), 0, 32) | extend GeneratedUUID = strcat( substring(rawHash, 0, 8), '-', substring(rawHash, 8, 4), '-', substring(rawHash, 12, 4), '-', substring(rawHash, 16, 4), '-', substring(rawHash, 20, 12) ) "
}
```
