**Detecting Text and CSV Data Dumps via Command Line**

This KQL Query detects when a device exports data to commonly used file formats like .csv or .txt.
This kind of behavior is often seen during the early stages of ransomware activity, where attackers collect internal information before exfiltrating it.
If you want to detect specific commands, you can use filters like:

 â¡ï¸ | ğ˜¸ğ˜©ğ˜¦ğ˜³ğ˜¦ ğ˜Šğ˜°ğ˜®ğ˜®ğ˜¢ğ˜¯ğ˜¥ ğ˜´ğ˜µğ˜¢ğ˜³ğ˜µğ˜´ğ˜¸ğ˜ªğ˜µğ˜© "ğ˜ğ˜¦ğ˜µ-ğ˜ˆğ˜‹ğ˜Šğ˜°ğ˜®ğ˜±ğ˜¶ğ˜µğ˜¦ğ˜³ -ğ˜ğ˜ªğ˜­ğ˜µğ˜¦ğ˜³ *"

 â¡ï¸ | ğ˜¸ğ˜©ğ˜¦ğ˜³ğ˜¦ ğ˜Šğ˜°ğ˜®ğ˜®ğ˜¢ğ˜¯ğ˜¥ ğ˜´ğ˜µğ˜¢ğ˜³ğ˜µğ˜´ğ˜¸ğ˜ªğ˜µğ˜© "ğ˜ğ˜¦ğ˜µ-ğ˜ˆğ˜‹ğ˜œğ˜´ğ˜¦ğ˜³ -ğ˜ğ˜ªğ˜­ğ˜µğ˜¦ğ˜³ *"
```
DeviceEvents
| where isnotempty(AdditionalFields) 
| extend Command = tostring(parse_json(AdditionalFields).Command)
// search for commands exporting data into .txt or .csv format
| where Command endswith ".txt" or Command endswith ".csv"
// excluding known cases
| where Command !startswith "Start-Process"
| project Timestamp, DeviceName, ActionType, ProcessCommandLine, Command, InitiatingProcessAccountName, InitiatingProcessAccountUpn, ProcessRemoteSessionDeviceName, ReportId
```
